БИТУправление_медицинским_центром_демо/src/Catalogs/ТипыОбращений/ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОбращений</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъектаОбратнойСвязи</name>
    <type>
      <types>EnumRef.ТипОбъектаОбратнойСвязи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОбслуживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ТипОбъектаОбратнойСвязи/ТипОбъектаОбратнойСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОбъектаОбратнойСвязи</name>
  <enumValues>
    <name>НеУказывается</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ОбъектОбратнойСвязи</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ТипыОбращений/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		Если Не ЗаявкаНаОбслуживание Тогда 
			Исполнители.Очистить();
		Иначе
			ТипОбъектаОбратнойСвязи = Перечисления.ТипОбъектаОбратнойСвязи.НеУказывается;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
